/* $Id$ */
/*
**  MK_DIC.H
**  2002. 01.  BY JaeBum, Kim.
*/
#ifndef _MK_DIC_
#define _MK_DIC_

#define MAX_POS_NUM		(96)
#define MAX_POS_LEN		(7)

char	m_PosTB[MAX_POS_NUM][MAX_POS_LEN] = {
"NNCG", /* 	:체언(N):명사(N):보통(C):일반(G)  */
"NNCV", /* 	:체언(N):명사(N):보통(C):동사(V)  */
"NNCJ",	/* 	:체언(N):명사(N):보통(C):형용사(J)  */
"NNB",	/* 	:체언(N):명사(N):의존(B)		*/
"NNBU",	/* 	:체언(N):명사(N):의존(B):단위(U)	*/
"NNP",	/* 	:체언(N):명사(N):고유(P)		*/
"NPP",	/* 	:체언(N):대명사(P):인칭(P)		*/
"NPI",	/* 	:체언(N):대명사(P):지시(I)		*/
"NU",	/* 	:체언(N):수사(U)				*/
"XSNN",	/* 	:접사(X):접미(S):체언(N):명사(N)	*/
"XSNND",	/* 	:접사(X):접미(S):체언(N):명사(N):관형(D)-적	*/
"XSNP",	/* 	:접사(X):접미(S):체언(N):대명사(P)	*/
"XSNU",	/* 	:접사(X):접미(S):체언(N):수사(U)	*/
"XSNPL",	/* 	:접사(X):접미(S):체언(N):복수(PL)-들	*/
"XPNN",	/* 	:접사(X):접두(P):체언(N):명사(N)	*/
"XPNU",	/* 	:접사(X):접두(P):체언(N):수사(U)	*/
"PS",	/* 	:조사(P):주격(S)		*/
"PC",	/* 	:조사(P):보격(C)		*/
"PO",	/* 	:조사(P):목적격(O)		*/
"PD",	/* 	:조사(P):관형격(D)		*/
"PA",	/* 	:조사(P):부사격(A)		*/
"PV",	/* 	:조사(P):호격(V)		*/
"PN",	/* 	:조사(P):접속(N)		*/
"PX",	/* 	:조사(P):보조(X)		*/
"DA",	/* 	:관형사(D):성상(A)		*/
"DI",	/* 	:관형사(D):지시(I)		*/
"DU",	/* 	:관형사(D):수(U)		*/
"XSD",	/* 	:접사(X):접미(S):관형사(D)-적	*/
"AA",	/* 	:부사(A):성상(A)		*/
"AP",	/* 	:부사(A):서술(P)		*/
"AI",	/* 	:부사(A):지시(I)		*/
"AC",	/* 	:부사(A):접속(C)		*/
"AV",	/* 	:부사(A):동사(V)		*/
"AJ",	/* 	:부사(A):형용사(J)		*/
"XSA",	/* 	:접사(X):접미(S):부사(A)	*/
"XSAH",	/* 	:접사(X):접미(S):부사(A):히(H)-히	*/
"C",	/* 	:감탄사(C)		*/
"I",	/* 	:서술격조사(I)		*/
"VV",	/* 	:용언(V):동사(V)	*/
"VVX",	/* 	:용언(V):동사(V):보조(X)	*/
"VJ",	/* 	:용언(V):형용사(J)			*/
"VJX",	/* 	:용언(V):형용사(J):보조(X)	*/
"XSVV",	/* 	:접사(X):접미(S):용언화(V):동사(V)		*/
"XSVJ",	/* 	:접사(X):접미(S):용언화(V):형동사(J)	*/
"XSVJD",	/* 	:접사(X):접미(S):용언화(V):형동사(J):답(D)-답	*/
"XSVJB",	/* 	:접사(X):접미(S):용언화(V):형동사(J):기타(B)-롭,스럽	*/
"EFF",	/* 	:어미(E):어말(F):종결(F)	*/
"EFC",	/* 	:어미(E):어말(F):연결(C)	*/
"EFN",	/* 	:어미(E):어말(F):명사(N)	*/
"EFD",	/* 	:어미(E):어말(F):관형(D)	*/
"EFA",	/* 	:어미(E):어말(F):부사(A)	*/
"EP",	/* 	:어미(E):선어말(P)			*/
"NN?",	/*	:체언(N):명사(N):추정(?)	*/
"V?",	/* 	:용언(V):추정(?)			*/
"SEVV",	/*	:어미+보조동사				*/
"SEVJ",	/*	:어미+보조형용사			*/
"SHO",	/*	:'하'축약형-생각다,생각지,...	*/
"SDB",	/*	:관형사(D)+의존명사(B)-이층,삼학년,...	*/
"SDN",	/*	:1음절관형어(D)+1음절명사(N)-그때,그곳,큰것,이말,저말,한잎,두잎,...		*/
"SBXV",	/* 	:의존명사(B)+보조동사(XV)-듯하,척하,...		*/
"SBXJ",	/* 	:의존명사(B)+보조형용사(XJ)-듯싶,...		*/
"SCVV",	/* 	:복합동사:명사+동사							*/
"SCVJ",	/* 	:복합형용사:명사+형용사						*/
"64",	/* 	:예약										*/
"N.IR",	/*	:불규칙체언									*/
"NN.CM",	/*	:합성명사								*/
"VV.R",	/* 	:규칙활용동사								*/
"VV.I",	/* 	:불규칙활용동사(러불규칙외)					*/
"VV.L",	/* 	:러불규칙활용동사							*/
"VJ.R",	/* 	:규칙활용형용사								*/
"VJ.I",	/* 	:불규칙활용형용사(러불규칙외)				*/
"VJ.L",	/* 	:러불규칙활용형용사							*/
"V.NC",	/*	:비축약용언									*/
"P.R.I",	/*	:서술격조사결합조사						*/
"P.V",	/* 	:무종성결합조사								*/
"P.C",	/* 	:유종성결합조사								*/
"P.L",	/* 	:ㄹ종성결합조사								*/
"P.IR",	/* 	:불규칙조사									*/
"E.L.V",	/* 	:동사결합어미		*/
"E.L.J",	/* 	:형용사결합어미		*/
"E.L.I",	/* 	:서술격조사결합어미	*/
"E.L.IX",	/* 	:서술격조사생략어미	*/
"E.L.P",	/* 	:선어말어미결합어미	*/
"E.R.P",	/* 	:조사결합어미		*/
"E.V",	/* 	:무종성결합어미		*/
"E.C",	/* 	:유종성결합어미		*/
"E.S",	/* 	:ㅆ,ㅄ종성결합어미	*/
"E.L",	/* 	:ㄹ종성결합어미		*/
"E.LX",	/* 	:ㄹ탈락어미			*/
"E.HX",	/* 	:ㅎ탈락어미			*/
"E.HC",	/* 	:하축약어미			*/
"E.IR",	/* 	:불규칙어미			*/
"E.P",	/*	:양성어미			*/
"E.N",	/*	:음성어미			*/
"E.NO",	/* 	:NOISE				*/
"E.USER",	/* 	:USER				*/
};

#define GET_INT_POS(a, b)\
{\
	for ( b = 0; b < MAX_POS_NUM; b++ )\
	{\
		if ( strcmp(a, m_PosTB[b]) == 0 )\
			break;\
	}\
	b = ((b > MAX_POS_NUM)? MAX_POS_NUM : b);\
}

#endif	/*  _MK_DIC_  */

/*
**  END MK_DIC.H
*/
